Repository: gerritv/Grbl-Panel
Catalog: Grbl-Panel/My Project/Resources.*.resx
Languages: fr_fr

# Button_Connection_Text_Connect
source: Connect
fr_fr: Connecter

# GrblGui_grblgui_unload_Are_You_Certain_That_You_Want_To_Close
source: Are You Certain That You Want To Close
fr_fr: Êtes-vous sûr de vouloir fermer?

# MsgFilter_PreFilterMessage_Start
source: Start
fr_fr: Départ

# GrblGui_btnConnDisconnect_Click_Disconnect
source: Disconnect
fr_fr: Déconnecter

# GrblGui_btnConnDisconnect_Click_Please_Select_A_Com_Port
source: Please Select A Com Port
fr_fr: Sélectionnez un Port COM, SVP

# GrblGui_btnConnDisconnect_Click_Or_Connect_The_Cable
source: Or Connect The Cable
fr_fr: Ou connectez le câble.

# GrblGui_btnConnDisconnect_Click_Connect_Error
source: Connect Error
fr_fr: Erreur de connexion

# GrblGui_btnConnDisconnect_Click_Please_Enter_An_IP_Address
source: Please Enter An IP Address
fr_fr: Entrez une adresse IP, SVP

# GrblGui_btnConnDisconnect_Click_And_A_Port_Number_In_The_Format
source: And A Port Number In The Format
fr_fr: et un numéro de port, dans le format

# GrblGui_btnConnDisconnect_Click_Connect
source: Connect
fr_fr: Connecter

# GrblGui_btnConnDisconnect_Click_PleaseSelectAComPort
source: Please select a Com port
fr_fr: Sélectionnez un port Com SVP

# GrblGui_btnConnDisconnect_Click_OrConnectTheCable
source: or connect the cable
fr_fr: ou connectez le cable

# GrblGui_btnConnDisconnect_Click_PleaseEnterAnIPAddress
source: Please enter an IP Address
fr_fr: Entrez une adresse IP SVP

# GrblGui_btnConnDisconnect_Click_AndAPortNumberInTheFormat
source: and a port number in the format
fr_fr: et un N° de port au format

# GrblGui_btnConnDisconnect_Click_Idle
source: Idle
fr_fr: Attente

# GrblGui_btnConnDisconnect_Click_End
source: End
fr_fr: Fin

# GrblGui_btnConnDisconnect_Click_Disconnected
source: Disconnected
fr_fr: Déconnecté

# GrblGui_grblgui_unload_AreYouCertainThatYouWantToClose
source: Are you certain that you want to close?
fr_fr: Êtes-vous sûr de vouloir fermer?

# GrblGui_showGrblStatus_IDLE
source: IDLE
fr_fr: PAUSE

# GrblGui_showGrblStatus_RUN
source: RUN
fr_fr: MARCHE

# GrblGui_showGrblStatus_Resume
source: Resume
fr_fr: Reprise

# GrblGui_showGrblStatus_HOLD
source: HOLD
fr_fr: RETIENS

# GrblGui_showGrblStatus_CHECK
source: CHECK
fr_fr: VERIF.

# AboutBox_AboutBox_Load_GrblPanelIsDesignedForUseWithGrbl09GOrLater
source: GrblPanel is designed for use with Grbl 0.9G or later.
fr_fr: Le panneau de contrôle Grbl est conçu pour être utilisé avec Grbl 0.9G où suivant

# AboutBox_AboutBox_Load_ForMoreDetailsOnThisAppPleaseVisit
source: For more details on this app, please visit:
fr_fr: Pour plus de détails sur cette application, visitez:

# GrblGcodeView_ExpectedCommandLetter
source: Expected command letter
fr_fr: Lettre de commande attendue

# GrblGcodeView_BadNumberFormat
source: Bad number format
fr_fr: Mauvais format de nombre

# GrblGcodeView_InvalidStatement
source: Invalid statement
fr_fr: Déclaration invalide

# GrblGcodeView_Value0
source: Value < 0
fr_fr: Valeur < 0

# GrblGcodeView_SettingDisabled
source: Setting disabled
fr_fr: Réglage désactivé

# GrblGcodeView_Value3Usec
source: Value < 3 usec
fr_fr: Valeur < 3 usec

# GrblGcodeView_EEPROMReadFailUsingDefaults
source: EEPROM read fail, using Defaults
fr_fr: Lecture EEPROM ratée, défauts utilisés

# GrblGcodeView_NotIdle
source: Not idle
fr_fr: Pas en attente

# GrblGcodeView_AlarmLock
source: Alarm lock
fr_fr: Blocage Alarme

# GrblGcodeView_HomingIsNotEnabled
source: Homing is not enabled
fr_fr: Référencement pas activé

# GrblGcodeView_LineOverflow
source: Line overflow
fr_fr: Dépassement de ligne

# GrblGcodeView_StepRate30kHz
source: Step rate > 30kHz
fr_fr: Taux des pas > 30 Khz

# GrblGcodeView_CheckDoor
source: Check door
fr_fr: Vérifier la porte

# GrblGcodeView_UnsupportedCommand
source: Unsupported command
fr_fr: Commande non supportée

# GrblGcodeView_ModalGroupViolation
source: Modal group violation
fr_fr: Violation groupe modal

# GrblGcodeView_UndefinedFeedRate
source: Undefined feed rate
fr_fr: Taux d'avance non défini

# GrblGcodeView_CommandValueIsNotInteger
source: Command value is not integer
fr_fr: Valeur de la commande pas un entier

# GrblGcodeView_AxisCommandConflict
source: Axis command conflict
fr_fr: Conflit Axe de la commande

# GrblGcodeView_WordRepeated
source: Word repeated
fr_fr: Mot répété

# GrblGcodeView_NoAxisWords
source: No axis words
fr_fr: Pas de mot d'axe

# GrblGcodeView_InvalidLineNumber
source: Invalid line number
fr_fr: N° de ligne invalide

# GrblGcodeView_ValueWordMissing
source: Value word missing
fr_fr: Valeur du mot manquante

# GrblGcodeView_UnsupportedCoordinateSystem
source: Unsupported coordinate system
fr_fr: Système de coordonnées non supporté

# GrblGcodeView_G53InvalidMotionMode
source: G53 invalid motion mode
fr_fr: Mode mouvement G53 invalide

# GrblGcodeView_AxisWordsExist
source: Axis words exist
fr_fr: Mot d'Axe existant

# GrblGcodeView_NoAxisWordsInPlane
source: No axis words in plane
fr_fr: Pas de mot d'axe dans ce plan

# GrblGcodeView_InvalidTarget
source: Invalid target
fr_fr: But non valide

# GrblGcodeView_ArcRadiusError
source: Arc radius error
fr_fr: Erreur de rayon d'arc

# GrblGcodeView_NoOffsetsInPlane
source: No offsets in plane
fr_fr: Pas de décalage dans ce plan

# GrblGcodeView_UnusedWords
source: Unused words
fr_fr: Mots inutilisés

# GrblGcodeView_G43DynamicAxisError
source: G43 dynamic axis error
fr_fr: G43 erreur axe dynamique

# GrblGcodeView_New_Line
source: Line
fr_fr: Ligne

# GrblIF_Disconnect_ErrorOnCloseOfGrblPort
source: Error on close of Grbl port
fr_fr: Erreur à la fermeture du port Grbl

# GrblIF_sendData_FatalErrorOnWriteToGrbl
source: Fatal error on write to Grbl
fr_fr: Erreur fatale en écriture dans Grbl

source: Are you sure you want to exit without saving your Macro changes?
fr_fr: Êtes-vous sûr de vouloir quitter sans sauver vos modifications de Macro?

# GrblGui_GrblMacroButtons_FormClosing_ConfirmExitWithoutSaving
source: Confirm exit without saving.
fr_fr: Confirmez sortie sans sauver

# GrblGui_GrblMacroButtons_Load_Add
source: Add
fr_fr: Ajout

# GrblGui_dgMacros_DoubleClick_Update
source: Update
fr_fr: M à J

# GrblGui_btnDeleteMacro_Click_AreYouSureYouWantToDeleteThe
source: Are you sure you want to delete the
fr_fr: Êtes-vous sûr de vouloir effacer la

# GrblGui_btnDeleteMacro_Click_ConfirmDelete
source: Confirm Delete
fr_fr: Confirmer effacement

# GrblGui_UpdateToolTip_NameAppearsOnTheButtonSoKeepItSmall
source: Name appears on the button, so keep it small
fr_fr: Le nom apparaît sur le bouton, faites court

# GrblGui_UpdateToolTip_DeleteTheSelectedMacro
source: Delete the selected macro
fr_fr: Effacer la macro sélectionnée

# GrblGui_UpdateToolTip_DblClickNameToEditMacro
source: DblClick name to edit macro
fr_fr: Dble-clic sur le nom pour éditer la macro

# GrblGui_UpdateToolTip_GetMeOuttaHereCancelAllChanges
source: Get me outta here, cancel all changes
fr_fr: Sortez-moi de là, abandonnez toutes les modification

# GrblGui_UpdateToolTip_GCodeToSendWhenTheButtonIsClicked
source: G-Code to send when the button is clicked.
fr_fr: G-Code à envoyer lorsque le bouton est cliqué

# GrblGui_UpdateToolTip_CommitAllChangesToSettingsAndClose
source: Commit all changes to Settings and close
fr_fr: Valider toutes les modifications et fermer

# GrblGui_UpdateToolTip_LimitIs5Macros
source: Limit is 5 macros
fr_fr: La limite est 5 macros

# GrblGui_btnAdd_Click_YouNeedToAddSomeGCodeToSaveAMacro
source: You need to add some G-code to save a macro
fr_fr: Il vous faut ajouter du G-Code pour sauver une macro

# GrblGui_btnAdd_Click_DataValidationError
source: Data Validation Error
fr_fr: Erreur en validation de données

# GrblGui_btnAdd_Click_YouCannotCreateAMacroWithoutAName
source: You cannot create a macro without a name.
fr_fr: Vous ne pouvez pas créer une macro sans nom

# GrblSettings_StepPulseUsec
source: step pulse, usec
fr_fr: Signal pas, uSec

# GrblSettings_StepIdleDelayMsec
source: step idle delay, msec
fr_fr: Délai pause entre pas, mSec

# GrblSettings_StepPortInvertMask
source: step port invert mask:
fr_fr: Masque inversion signal pas

# GrblSettings_DirPortInvertMask
source: dir port invert mask:
fr_fr: Masque inversion direction pas:

# GrblSettings_StepEnableInvertBool
source: step enable invert, bool
fr_fr: Inversion activation pas, bool

# GrblSettings_LimitPinsInvertBool
source: limit pins invert, bool
fr_fr: Inversion switch limites, bool

# GrblSettings_ProbePinInvertBool
source: probe pin invert, bool
fr_fr: Inversion de la sonde, bool

# GrblSettings_StatusReportMask
source: status report mask
fr_fr: Masque du suivi de statut

# GrblSettings_JunctionDeviationMm
source: junction deviation, mm
fr_fr: Ecart de jonction, mm

# GrblSettings_ArcToleranceMm
source: arc tolerance, mm
fr_fr: Tolérance d'Arc, mm

# GrblSettings_ReportInchesBool
source: report inches, bool
fr_fr: Suivi de statut en pouces, bool

# GrblSettings_SoftLimitsBool
source: soft limits, bool
fr_fr: Limites Logiques, bool

# GrblSettings_HardLimitsBool
source: hard limits, bool
fr_fr: Limites Physiques, bool

# GrblSettings_HomingCycleBool
source: homing cycle, bool
fr_fr: Cycle de référencement (homing), bool

# GrblSettings_HomingDirInvertMask
source: homing dir invert mask
fr_fr: Masque inversion dir. Référencement

# GrblSettings_HomingFeedMmMin
source: homing feed, mm/min
fr_fr: Avance Référencement, mm/min

# GrblSettings_HomingSeekMmMin
source: homing seek, mm/min
fr_fr: Détection Référencement, mm/min

# GrblSettings_HomingDebounceMsec
source: homing debounce, msec
fr_fr: Délai rebond référencement ,mSec

# GrblSettings_HomingPullOffMm
source: homing pull-off, mm
fr_fr: Retrait Référencement, mm

# GrblSettings_RpmMax
source: rpm max
fr_fr: Max t/mn

# GrblSettings_RpmMin
source: rpm min
fr_fr: Min t/mn

# GrblSettings_XStepMm
source: x, step/mm
fr_fr: X, pas/mm

# GrblSettings_YStepMm
source: y, step/mm
fr_fr: Y, pas/mm

# GrblSettings_ZStepMm
source: z, step/mm
fr_fr: Z, pas/mm

# GrblSettings_AStepMm
source: a, step/mm
fr_fr: A, pas/mm

# GrblSettings_XMaxRateMmMin
source: x max rate, mm/min
fr_fr: Taux Avance Max X, mm/min

# GrblSettings_YMaxRateMmMin
source: y max rate, mm/min
fr_fr: Taux Avance Max Y, mm/min

# GrblSettings_ZMaxRateMmMin
source: z max rate, mm/min
fr_fr: Taux Avance Max Z, mm/min

# GrblSettings_AMaxRateMmMin
source: a max rate, mm/min
fr_fr: Taux Avance Max A, mm/min

# GrblSettings_XAccelMmSec2
source: x accel, mm/sec^2
fr_fr: Accélération en X, mm/sec^2

# GrblSettings_YAccelMmSec2
source: y accel, mm/sec^2
fr_fr: Accélération en Y, mm/sec^2

# GrblSettings_ZAccelMmSec2
source: z accel, mm/sec^2
fr_fr: Accélération en Z, mm/sec^2

# GrblSettings_AAccelMmSec2
source: a accel, mm/sec^2
fr_fr: Accélération en A, mm/sec^2

# GrblSettings_XMaxTravelMm
source: x max travel, mm
fr_fr: Course Max en X, mm

# GrblSettings_YMaxTravelMm
source: y max travel, mm
fr_fr: Course Max en Y, mm

# GrblSettings_ZMaxTravelMm
source: z max travel, mm
fr_fr: Course Max en Z, mm

# GrblSettings_AMaxTravelMm
source: a max travel, mm
fr_fr: Couse Max en A, mm

# GrblSettings_FillSettings_Value
source: Value
fr_fr: Valeur
